Repository: Chanuth412-pixel/agrimate
Catalog: lib/l10n/app_*.arb
Languages: si

# appTitle
source: Agrimate
si: ආග්‍රිමේට්

source: Login
si: ඇතුල් වන්න

source: Sign Up
si: ලියාපදිංචි වන්න

source: Email
si: ඊමේල්

source: Password
si: මුරපදය

source: Forgot Password?
si: මුරපදය අමතකද?

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Select Role
si: භූමිකාව තෝරන්න

source: Select Language
si: භාෂාව තෝරන්න

source: Choose your role
si: ඔබේ භූමිකාව තෝරන්න

# selectRoleDescription
source: Select a role to continue. You can change this later in settings.
si: ඉදිරියට යාමට භූමිකාවක් තෝරන්න. ඔබට මෙය පසුව සැකසීම්වලින් වෙනස් කළ හැක.

# farmerDescription
source: Manage harvests, weather insights and orders.
si: අස්වැන්න, කාලගුණ තොරතුරු සහ ඇණවුම් කළමනාකරණය කරන්න.

# customerDescription
source: Browse fresh produce and place orders.
si: නැවුම් නිෂ්පාදන බ්‍රවුස් කරන්න සහ ඇණවුම් කරන්න.

# driverDescription
source: Deliver orders and view schedules.
si: ඇණවුම් බෙදා හරින්න සහ කාලසටහන් බලන්න.

source: Welcome Back, Customer!
si: ආයුබෝවන්, පාරිභෝගිකයා!

source: Welcome Back, Farmer!
si: ආයුබෝවන්, ගොවියා!

source: Welcome Back, Driver!
si: ආයුබෝවන්, රියදුරු!

source: Welcome Customer!
si: ආයුබෝවන් පාරිභෝගිකයා!

source: Welcome Farmer!
si: ආයුබෝවන් ගොවියා!

source: Welcome Driver!
si: ආයුබෝවන් රියදුරු!

source: Let's grow together
si: අපි එකට වර්ධනය වෙමු

source: Log in
si: ඇතුළු වන්න

source: Create Profile
si: පැතිකඩ සාදන්න

source: Email/Phone
si: ඊමේල්/දුරකථනය

source: Name
si: නම

source: Location
si: ස්ථානය

source: Phone
si: දුරකථනය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

source: Passwords do not match
si: මුරපද නොගැලපේ

source: Profile created successfully
si: පැතිකඩ සාර්ථකව නිර්මාණය කරන ලදි

source: Login failed
si: ඇතුළු වීම අසාර්ථකයි

source: Profile not found
si: පැතිකඩ හමු නොවීය

source: Enter Email
si: ඊමේල් ඇතුළත් කරන්න

source: Enter Password
si: මුරපදය ඇතුළත් කරන්න

source: Enter Name
si: නම ඇතුළත් කරන්න

source: Enter Location
si: ස්ථානය ඇතුළත් කරන්න

source: Enter Phone
si: දුරකථනය ඇතුළත් කරන්න

source: Full Name
si: සම්පූර්ණ නම

source: Phone Number
si: දුරකථන අංකය

source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

source: Please enter {field}
si: කරුණාකර {field} ඇතුළත් කරන්න

source: Not specified
si: සඳහන් කර නැත

# pleaseSignIn
source: Please sign in to continue.
si: කරුණාකර ඇතුල් වීමට උත්සාහ කරන්න.

# pleaseChooseRole
source: Please choose your role to continue:
si: කරුණාකර ඉදිරියට යාමට ඔබේ භූමිකාව තෝරන්න:

source: Farmer
si: ගොවියා

source: Customer
si: පාරිභෝගිකයා

source: Driver
si: රියදුරු

source: Customer Login
si: පාරිභෝගික ඇතුල් වීම

source: Driver Login
si: රියදුරු ඇතුල් වීම

source: Farmer Login
si: ගොවියා ඇතුල් වීම

source: Create Driver Profile
si: රියදුරු පැතිකඩ සාදන්න

source: Dashboard
si: ඩෑෂ්බෝඩ්

source: Profile
si: පැතිකඩ

source: Settings
si: සැකසීම්

source: Logout
si: ඉවත් වන්න

source: Crop Demand Trends
si: බෝග ඉල්ලුම් ප්‍රවණතා

source: Ongoing Transactions
si: විදුරුමස් ගනුදෙනු

# weekDemandForecast
source: 4-Week Demand Forecast
si: සති 4ක ඉල්ලුම් පුරෝකථනය

source: Delivery Guy
si: බෙදාහරින්නා

source: Self Delivery
si: ස්වයං බෙදාහැරීම

source: Choose Delivery
si: බෙදාහැරීම තෝරන්න

source: Add Harvest
si: අස්වැන්න එකතු කරන්න

source: Quantity
si: ප්‍රමාණය

source: Unit Price
si: ඒකක මිල

source: Pending
si: අවදානයෙන්

source: Assigned
si: පවරන ලද

source: In Transit
si: ප්‍රවාහනයේ

source: Delivered
si: බෙදා හරින ලද

source: Save
si: සුරකින්න

source: Cancel
si: අවලංගු කරන්න

source: Edit
si: සංස්කරණය

source: Delete
si: මකන්න

source: Back
si: ආපසු

source: Next
si: ඊළඟ

source: Previous
si: කලින්

source: Close
si: වසන්න

source: OK
si: හරි

source: Yes
si: ඔව්

source: No
si: නැත

source: Farmer Dashboard
si: ගොවි පුවරුව

source: Something went wrong
si: යමක් වැරදී ගියේය

source: No harvests yet
si: තවම අස්වැන්න නැත

# addFirstHarvest
source: Add your first harvest to get started
si: ආරම්භ කිරීමට ඔබේ පළමු අස්වැන්න එක් කරන්න

# addHarvestButton
source: + Add Harvest
si: + අස්වැන්න එක් කරන්න

source: Crop Name
si: බෝගයේ නම

source: Expected Quantity
si: අපේක්ෂිත ප්‍රමාණය

source: Price per KG
si: කිලෝග්‍රාමයකට මිල

source: Harvest Date
si: අස්වැන්න ලබන දිනය

source: Description
si: විස්තරය

source: Save Harvest
si: අස්වැන්න සුරකින්න

source: My Profile
si: මගේ පැතිකඩ

# personalInfo
source: Personal Information
si: පුද්ගලික තොරතුරු

# contactInfo
source: Contact Information
si: සම්බන්ධතා තොරතුරු

source: Update Profile
si: පැතිකඩ යාවත්කාලීන කරන්න

source: View Details
si: විස්තර බලන්න

source: Add New Harvest
si: නව අස්වැන්නක් එක් කරන්න

source: Preview
si: පූර්ව දසුන

source: Submit
si: ඉදිරිපත් කරන්න

# previewCompleted
source: Preview completed! You can now submit your harvest data.
si: පූර්ව දසුන සම්පූර්ණයි! ඔබට දැන් ඔබේ අස්වැන්න දත්ත ඉදිරිපත් කළ හැක.

# pleasePreviewFirst
source: Please preview your data first before submitting!
si: කරුණාකර ඉදිරිපත් කිරීමට පෙර ඔබේ දත්ත පූර්ව දසුන කරන්න!

# dataChangedPreviewAgain
source: Data has changed since last preview. Please preview again.
si: අවසන් පූර්ව දසුනේ සිට දත්ත වෙනස් වී ඇත. කරුණාකර නැවත පූර්ව දසුන කරන්න.

# pleaseLoginToSubmit
source: Please log in to submit harvest data.
si: අස්වැන්න දත්ත ඉදිරිපත් කිරීමට කරුණාකර ඇතුළු වන්න.

# harvestSubmittedSuccessfully
source: Harvest data submitted successfully!
si: අස්වැන්න දත්ත සාර්ථකව ඉදිරිපත් කරන ලදී!

# errorSubmittingHarvest
source: Error submitting harvest data
si: අස්වැන්න දත්ත ඉදිරිපත් කිරීමේ දෝෂය

source: Planting Date
si: වගා කරන දිනය

source: Select Crop
si: බෝගය තෝරන්න

source: Sign up failed
si: ලියාපදිංචි වීම අසාර්ථක විය

# errorOccurred
source: Error
si: දෝෂය

source: Auth error
si: සත්‍යාපන දෝෂය
